INSERT INTO Persons (FullName,DateOfBirth) VALUES
	('Смирнова Татьяна Александровна','2006-01-13')--1 9а
	,('Романова Екатерина Матвеевна','2006-02-10')--2 9а
	,('Власова Антонина Артемьевна','2006-01-08')--3 9а
	,('Иванова Алиса Давидовна','2006-08-11')--4 9а
	,('Воробьев Артём Святославович','2006-06-16')--5 9а
	,('Самойлов Степан Михайлович','2006-11-03')--6 9а
	,('Шестакова Ясмина Мирославовна','2006-03-18')--7 9б
	,('Михайлова Виктория Матвеевна','2006-12-01')--8 9б
	,('Смирнова Варвара Георгиевна','2006-02-19')--9 9б
	,('Миронов Ярослав Даниилович','2006-02-06')--10 9б
	,('Калычев Илья Николаевич','2005-10-10')--11 9б
	,('Прокофьева Дарина Ильинична','2006-09-06')--12 10
	,('Софронова Милана Елисеевна','2005-05-07')--13 10
	,('Лобанов Тимофей Глебович','2006-05-05')--14 10
	,('Колпаков Александр Дмитриевич','2006-04-15')--15 10
	,('Никулин Демьян Михайлович','2006-10-21')--16 11
	,('Муратова Екатерина Артёмовна','2006-06-24')--17 11
	,('Иванова Василиса Леонидовна','2006-08-27')--18 11
	,('Горшкова Виктория Ивановна','2006-07-20')--19 11
	,('Зайцева Валентина Федоровна','1988-09-23')--20 русский кл.рук.9а
	,('Соболева Лидия Егоровна','1979-11-06')--21 математика кл.рук.9б
	,('Соколова Алиса Данииловна','1963-03-20')--22 физика кл.рук.10
	,('Осипов Василий Куприянович','1986-05-26')--23 физкультура
	,('Гусев Сергей Макарович','1987-06-19');--24 биология кл.рук.11

INSERT INTO Roles([Role]) VALUES
	('ученик'),('учитель');

INSERT INTO PersonRole (PersonID,RoleID) VALUES
	(1,1),(2,1),(3,1),(4,1),(5,1),(6,1),(7,1),(8,1),(9,1),(10,1)
	,(11,1),(12,1),(13,1),(14,1),(15,1),(16,1),(17,1),(18,1),(19,1),(20,2)
	,(21,2),(22,2),(23,2),(24,2);

INSERT INTO Subjects (Title) VALUES
	('Русский язык')--1
	,('Математика')--2
	,('Физика')--3
	,('Физкультура')--4
	,('Биология');--5

INSERT INTO Teachers (PersonID, SubjectID) VALUES
	(20,1),(21,2),(22,3),(23,4),(24,5);

INSERT INTO Classes (Title,TeacherID) VALUES
	('9А',1),('9Б',2),('10',3),('11',5);

INSERT INTO Pupils (PersonID,ClassID) VALUES
	(1,1),(2,1),(3,1),(4,1),(5,1),(6,1)
	,(7,2),(8,2),(9,2),(10,2),(11,2)
	,(12,3),(13,3),(14,3),(15,3)
	,(16,4),(17,4),(18,4),(19,4);

INSERT INTO Grades (SubjectID,PupilID,AnnualEstimate) VALUES
--1
	(1,1,4),(2,1,4),(3,1,5),(4,1,3),(5,1,4),
--2
	(1,2,4),(2,2,4),(3,2,5),(4,2,3),(5,2,4),
--3
	(1,3,4),(2,3,4),(3,3,5),(4,3,3),(5,3,4),
--4
	(1,1,4),(2,1,4),(3,1,5),(4,1,3),(5,1,4),
--5
	(1,5,4),(2,5,4),(3,5,4),(4,5,3),(5,5,4),
--6
	(1,6,4),(2,6,4),(3,6,4),(4,6,3),(5,6,4),
--7
	(1,7,3),(2,7,4),(3,7,5),(4,7,3),(5,7,4),
--8
	(1,8,4),(2,8,4),(3,8,5),(4,8,3),(5,8,4),
--9
	(1,9,5),(2,9,5),(3,9,5),(4,9,5),(5,9,5),
--10
	(1,10,4),(2,10,4),(3,10,5),(4,10,3),(5,10,4),
--11
	(1,11,4),(2,11,4),(3,11,5),(4,11,4),(5,11,4),
--12
	(1,12,4),(2,12,4),(3,12,5),(4,12,3),(5,12,4),
--13
	(1,13,4),(2,13,4),(3,13,4),(4,13,5),(5,13,4),
--14
	(1,14,4),(2,14,4),(3,14,5),(4,14,3),(5,14,4),
--15
	(1,15,5),(2,15,5),(3,15,5),(4,15,5),(5,15,5),
--16
	(1,16,4),(2,16,4),(3,16,5),(4,16,3),(5,16,4),
--17
	(1,17,4),(2,17,4),(3,17,5),(4,17,3),(5,17,4),
--18
	(1,18,4),(2,18,4),(3,18,5),(4,18,3),(5,18,4),
--19
	(1,19,4),(2,19,4),(3,19,5),(4,19,3),(5,19,4);

INSERT INTO Timetable (DateOfWeek,LessonNumber,ClassID,SubjectID) VALUES
--9а
	('Понедельник', 1, 1, 1),('Понедельник', 2, 1, 2)
	,('Вторник', 1, 1, 2),('Вторник', 2, 1, 5),('Вторник', 3, 1, 4)
	,('Среда', 1, 1, 5),('Среда', 2, 1, 3)
	,('Четверг', 1, 1, 1),('Четверг', 2, 1, 2)
	,('Пятница', 1, 1, 4),
--9б
	('Понедельник', 1, 2, 2)
	,('Вторник', 1, 2, 3),('Вторник', 2, 2, 1)
	,('Среда', 1, 2, 2),('Среда', 2, 2, 5)
	,('Четверг', 1, 2, 4),('Четверг', 2, 2, 3),('Четверг', 3, 2, 1)
	,('Пятница', 1, 2, 2),
--10
	('Понедельник', 1, 3, 5),('Понедельник', 2, 3, 1),('Понедельник', 3, 3, 4)
	,('Вторник', 1, 3, 1),('Вторник', 2, 3, 4)
	,('Среда', 1, 3, 4)
	,('Четверг', 1, 3, 3),('Четверг', 2, 3, 1)
	,('Пятница', 1, 3, 1),('Пятница', 2, 3, 2),
--11
	('Понедельник', 1, 4, 3)
	,('Вторник', 1, 4, 5),('Вторник', 2, 4, 2)
	,('Среда', 1, 4, 3),('Среда', 2, 4, 4)
	,('Четверг', 1, 4, 2)
	,('Пятница', 1, 4, 5),('Пятница', 2, 4, 1),('Пятница', 3, 4, 3);